PGM
DCL        VAR(&SRCLIB) TYPE(*CHAR) LEN(10) VALUE(QTEMP)
DCL        VAR(&BLDLIB) TYPE(*CHAR) LEN(10) VALUE(QTEMP)
DCL        VAR(&TGTLIB) TYPE(*CHAR) LEN(10) VALUE(MILANO2019)
CRTLIB     LIB(&TGTLIB)
MONMSG     MSGID(CPF0000)
CRTMNU     MENU(&TGTLIB/PR_DEMO) TYPE(*UIM) SRCFILE(&SRCLIB/QMNUSRC)
CRTCLPGM   PGM(&TGTLIB/REDISSRV) SRCFILE(&SRCLIB/QCLSRC)
ENDPGM
