PGM
DCL VAR(&NULL) TYPE(*CHAR) LEN(1) VALUE(X'00')
DCL VAR(&IFS) TYPE(*CHAR) LEN(80) VALUE('/PowerRuby/oss/bin/redis-server')
DCL VAR(&MBR) TYPE(*CHAR) LEN(10) VALUE('REDIS64B')
CHGVAR VAR(&IFS) VALUE(&IFS *TCAT &NULL)
SBMJOB CMD(CALL PGM(QP2SHELL) PARM(&IFS)) JOB(&MBR) +
  JOBQ(QSYS/QSYSNOMAX) CCSID(37) ALWMLTTHD(*YES)
ENDPGM
